apache/nuttx/boards/arm/stm32f4/mikroe-stm32f4/src/stm32_touchscreen.c
/****************************************************************************
 * boards/arm/stm32f4/mikroe-stm32f4/src/stm32_touchscreen.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <string.h>
#include <fcntl.h>
#include <poll.h>
#include <sched.h>
#include <assert.h>
#include <errno.h>

#include <nuttx/debug.h>
#include <nuttx/irq.h>
#include <nuttx/board.h>
#include <nuttx/clock.h>
#include <nuttx/wqueue.h>
#include <nuttx/fs/fs.h>
#include <nuttx/input/touchscreen.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>

#include <arch/board/board.h>
#include "arm_internal.h"
#include "stm32_adc.h"
#include "stm32_gpio.h"
#include "mikroe-stm32f4.h"

#ifdef CONFIG_INPUT

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* Reference counting is partially implemented, but not needed in the current
 * design.
 */

#define CONFIG_TOUCHSCREEN_REFCNT
/* Should we try again on bad samples? */

#undef CONFIG_TOUCHSCREEN_RESAMPLE

/* TP uses ADC Channel #2 in a dedicated mode.  Ensure ADC2 not selected for
 * general use via the menuconfig
 */

#ifndef CONFIG_STM32_ADC2
#  error   Touchpanel Input (CONFIG_INPUT=y) requires enablinga ADC2 (CONFIG_STM32_ADC2=y)
#endif

/* Work queue support is required */

#ifndef CONFIG_SCHED_WORKQUEUE
#  warning Work queue support is required (CONFIG_SCHED_WORKQUEUE=y)
#endif

/* CONFIG_TOUCHSCREEN_THRESHX and CONFIG_TOUCHSCREEN_THRESHY
 *   Touchscreen data comes in a a very high rate.  New touch positions
 *   will only be reported when the X or Y data changes by these thresholds.
 *   This trades reduces data rate for some loss in dragging accuracy.  The
 *   touchscreen is configure for 12-bit values so the raw ranges are 0-4096.
 *   So for example, if your display is 320x240, then THRESHX=3 and THRESHY=4
 *   would correspond to one pixel.  Default: 4
 */

#ifndef CONFIG_TOUCHSCREEN_THRESHX
#  define CONFIG_TOUCHSCREEN_THRESHX 12
#endif

#ifndef CONFIG_TOUCHSCREEN_THRESHY
#  define CONFIG_TOUCHSCREEN_THRESHY 12
#endif

#ifndef CONFIG_TOUCHSCREEN_AVG_SAMPLES
#  define CONFIG_TOUCHSCREEN_AVG_SAMPLES 2
#endif

#ifndef CONFIG_TOUCHSCREEN_NPOLLWAITERS
#  define CONFIG_TOUCHSCREEN_NPOLLWAITERS 2
#endif

/* Driver support ***********************************************************/

/* This format is used to construct the /dev/input[n] device driver path.  It
 * is defined here so that it will be used consistently in all places.
 */

#define DEV_FORMAT   "/dev/input%d"
#define DEV_NAMELEN  16

/* Mikroe-STM32M4 Touchscreen Hardware Definitions **************************
 * PIN CONFIGURATIONS      SIGNAL NAME          ON-BOARD CONNECTIONS
 * --- ---------------------------------- -------------------- --------------
 *  35 PB0                 LCD-YD               YD Analog input
 *  36 PB1                 LCD-XL               XL Analog input
 *  95 PB8                 DRIVEA               Drives XR, XL and YU
 *  96 PB9                 DRIVEB               Drives YD
 */

#define LCD_YD_PIN           (0)
#define LCD_XL_PIN           (1)
#define LCD_YD_CHANNEL       (8)
#define LCD_XL_CHANNEL       (9)
#define LCD_DRIVEA_PIN       (8)
#define LCD_DRIVEB_PIN       (9)

#define LCD_DRIVEA_BIT       (1 << LCD_DRIVEA_PIN)
#define LCD_DRIVEB_BIT       (1 << LCD_DRIVEB_PIN)
#define LCD_SAMPX_BITS       (LCD_DRIVEA_BIT | (LCD_DRIVEB_BIT << 16))
#define LCD_SAMPY_BITS       (LCD_DRIVEB_BIT | (LCD_DRIVEA_BIT << 16))
#define LCD_TP_PORT_SETRESET  STM32_GPIOB_BSRR

#define TC_ADC_BASE           STM32_ADC2_BASE      /* ADC Channel base for TP */
#define ADC_CR1_ALLINTS       (ADC_CR1_AWDIE | ADC_CR1_EOCIE | ADC_CR1_JEOCIE)

/* Conversions are performed as 10-bit samples represented as 16-bit */

#define MAX_ADC               (4096)

/* A measured value has to be within this range to be considered */

#define UPPER_THRESHOLD       (MAX_ADC-1)
#define LOWER_THRESHOLD       (362)

/* Delays *******************************************************************/

/* All values will be increased by one system timer tick (probably 10MS). */

#define TC_PENUP_POLL_TICKS   MSEC2TICK(70)  /* IDLE polling rate: 70 MSec */
#define TC_PENDOWN_POLL_TICKS MSEC2TICK(40)  /* Active polling rate: 40 MSec */
#define TC_DEBOUNCE_TICKS     MSEC2TICK(16)  /* Delay before re-sampling: 16 MSec */
#define TC_SAMPLE_TICKS       MSEC2TICK(4)   /* Delay for A/D sampling: 4 MSec */
#define TC_SETTLE_TICKS       MSEC2TICK(10)  /* Delay for A/D settling: 10 MSec */
#define TC_RESAMPLE_TICKS     TC_SAMPLE_TICKS

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This enumeration describes the state of touchscreen state machine */

enum tc_state_e
{
  TC_READY = 0,                        /* Ready to begin next sample */
  TC_READY_SETTLE,                     /* Allowing time for Y DRIVE to settle */
  TC_YPENDOWN,                         /* Allowing time for the Y pen down sampling */
  TC_DEBOUNCE,                         /* Allowing a debounce time for the first sample */
  TC_RESAMPLE,                         /* Restart sampling on a bad measurement */
  TC_YSAMPLE,                          /* Allowing time for the Y sampling */
  TC_XSETTLE,                          /* Allowing time for the X to settle after changing DRIVE */
  TC_XSAMPLE,                          /* Allowing time for the X sampling */
  TC_XRESAMPLE,                        /* Allow time to resample X */
  TC_PENDOWN,                          /* Conversion is complete -- pen down */
  TC_PENUP                             /* Conversion is complete -- pen up */
};

/* This describes the state of one contact */

enum tc_contact_e
{
  CONTACT_NONE = 0,                    /* No contact */
  CONTACT_DOWN,                        /* First contact */
  CONTACT_MOVE,                        /* Same contact, possibly different position */
  CONTACT_UP,                          /* Contact lost */
};

/* This structure describes the results of one touchscreen sample */

struct tc_sample_s
{
  uint8_t  id;                         /* Sampled touch point ID */
  uint8_t  contact;                    /* Contact state (see enum tc_contact_e) */
  bool     valid;                      /* True: x,y contain valid, sampled data */
  uint16_t x;                          /* Thresholded X position */
  uint16_t y;                          /* Thresholded Y position */
};

/* This structure describes the state of one touchscreen driver instance */

