apache/nuttx/boards/arm/stm32f4/mikroe-stm32f4/src/stm32_touchscreen.c
struct tc_dev_s
{
#ifdef CONFIG_TOUCHSCREEN_REFCNT
  uint8_t crefs;                       /* Number of times the device has been opened */
#endif
  uint8_t state;                       /* See enum tc_state_e */
  uint8_t nwaiters;                    /* Number of threads waiting for touchscreen data */
  uint8_t id;                          /* Current touch point ID */
  volatile bool penchange;             /* An unreported event is buffered */
  uint16_t value;                      /* Partial sample value (Y+ or X-) */
  uint16_t newy;                       /* New, un-thresholded Y value */
  uint8_t sampcount;                   /* Count of samples for average so far */
  uint8_t resamplecount;               /* Countdown to PENUP */
  mutex_t devlock;                     /* Manages exclusive access to this structure */
  sem_t waitsem;                       /* Used to wait for the availability of data */
  struct tc_sample_s sample;           /* Last sampled touch point data */
  struct work_s work;                  /* Supports the state machine delayed processing */

  /* The following is a list if poll structures of threads waiting for
   * driver events. The 'struct pollfd' reference for each open is also
   * retained in the f_priv field of the 'struct file'.
   */

  struct pollfd *fds[CONFIG_TOUCHSCREEN_NPOLLWAITERS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void tc_adc_init(void);
static void tc_adc_start_sample(int pin);
static uint16_t tc_adc_read_sample(void);
static void tc_y_sample(void);
static void tc_x_sample(void);
static inline bool tc_valid_sample(uint16_t sample);

static void tc_notify(struct tc_dev_s *priv);
static int tc_sample(struct tc_dev_s *priv,
                     struct tc_sample_s *sample);
static int tc_waitsample(struct tc_dev_s *priv,
                         struct tc_sample_s *sample);
static void tc_worker(void *arg);

/* Character driver methods */

static int tc_open(struct file *filep);
static int tc_close(struct file *filep);
static ssize_t tc_read(struct file *filep, char *buffer, size_t len);
static int tc_ioctl(struct file *filep, int cmd, unsigned long arg);
static int tc_poll(struct file *filep, struct pollfd *fds, bool setup);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* This the vtable that supports the character driver interface */

static const struct file_operations g_tc_fops =
{
  tc_open,    /* open */
  tc_close,   /* close */
  tc_read,    /* read */
  NULL,       /* write */
  NULL,       /* seek */
  tc_ioctl,   /* ioctl */
  NULL,       /* mmap */
  NULL,       /* truncate */
  tc_poll     /* poll */
};

/* If only a single touchscreen device is supported, then the driver state
 * structure may as well be pre-allocated.
 */

#ifndef CONFIG_TOUCHSCREEN_MULTIPLE
static struct tc_dev_s g_touchscreen;
static bool g_touchinitdone = false;
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: tc_adc_getreg
 *
 * Description:
 *   Read the value of an TC ADC channel (#2) register.
 *
 * Input Parameters:
 *   offset - The offset to the register to read
 *   value
 *
 * Returned Value:
 *
 ****************************************************************************/

static inline uint32_t tc_adc_getreg(int offset)
{
  return getreg32(TC_ADC_BASE + offset);
}

/****************************************************************************
 * Name: tc_adc_putreg
 *
 * Description:
 *   Set the value of an ADC register.
 *
 * Input Parameters:
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *
 ****************************************************************************/

static inline void tc_adc_putreg(int offset, uint32_t value)
{
  putreg32(value, TC_ADC_BASE + offset);
}

/****************************************************************************
 * Name: tc_adc_init
 *
 * Description:
 *   Initialize ADC Channel #2 for use with the touch panel.  The touch panel
 *   uses Channels 8 and 9 (PB0 and PB1) to read the X and Y axis touch
 *   positions.
 *
 ****************************************************************************/

static void tc_adc_init(void)
{
  irqstate_t flags;
  uint32_t regval;

  /* Do an rcc reset to reset the ADC peripheral */

  /* Disable interrupts.  This is necessary because the APB2RTSR register
   * is used by several different drivers.
   */

  flags = enter_critical_section();

  /* Enable  ADC reset state */

  regval = getreg32(STM32_RCC_APB2RSTR);
  regval |= RCC_APB2RSTR_ADCRST;
  putreg32(regval, STM32_RCC_APB2RSTR);

  /* Release ADC from reset state */

  regval &= ~RCC_APB2RSTR_ADCRST;
  putreg32(regval, STM32_RCC_APB2RSTR);

  /* Initialize the watchdog high threshold register */

  tc_adc_putreg(STM32_ADC_HTR_OFFSET, 0x00000fff);

  /* Initialize the watchdog low threshold register */

  tc_adc_putreg(STM32_ADC_LTR_OFFSET, 0x00000000);

  /* Initialize the same sample time for each ADC 55.5 cycles
   *
   * During sample cycles channel selection bits must remain unchanged.
   *
   *   000:   1.5 cycles
   *   001:   7.5 cycles
   *   010:  13.5 cycles
   *   011:  28.5 cycles
   *   100:  41.5 cycles
   *   101:  55.5 cycles
   *   110:  71.5 cycles
   *   111: 239.5 cycles
   */

  tc_adc_putreg(STM32_ADC_SMPR1_OFFSET, 0x00b6db6d);
  tc_adc_putreg(STM32_ADC_SMPR2_OFFSET, 0x00b6db6d);

  /* ADC CR1 Configuration */

  regval  = tc_adc_getreg(STM32_ADC_CR1_OFFSET);

  /* Initialize the Analog watchdog enable */

  regval &= ~ADC_CR1_AWDEN;
  regval |= (LCD_YD_CHANNEL << ADC_CR1_AWDCH_SHIFT);

