apache/nuttx/boards/arm/stm32f4/mikroe-stm32f4/src/stm32_touchscreen.c
  /* Enable interrupt flags */

  /* regval |= ADC_CR1_ALLINTS; */

  /* Disable Overrun interrupt */

  regval &= ~ADC_CR1_OVRIE;

  /* Set the resolution of the conversion.  We only need 10 bits. */

  regval |= ADC_CR1_RES_12BIT;

  tc_adc_putreg(STM32_ADC_CR1_OFFSET, regval);

  /* ADC CR2 Configuration */

  regval  = tc_adc_getreg(STM32_ADC_CR2_OFFSET);

  /* Clear CONT, continuous mode disable.  We will perform single
   * sampling on one channel at a time.
   */

  regval &= ~ADC_CR2_CONT;

  /* Set ALIGN (Right = 0) */

  regval &= ~ADC_CR2_ALIGN;

  /* External trigger disable.  We will do SW triggering */

  regval &= ~ADC_CR2_EXTEN_MASK;

  tc_adc_putreg(STM32_ADC_CR2_OFFSET, regval);

  /* Configuration of the channel conversion - start with Y sampling */

  regval = tc_adc_getreg(STM32_ADC_SQR3_OFFSET) & ADC_SQR3_RESERVED;
  regval |= LCD_YD_CHANNEL;
  tc_adc_putreg(STM32_ADC_SQR3_OFFSET, regval);

  /* Set the number of conversions = 1 */

  regval = tc_adc_getreg(STM32_ADC_SQR1_OFFSET) & ADC_SQR1_RESERVED;
  regval |= 0 << ADC_SQR1_L_SHIFT;
  tc_adc_putreg(STM32_ADC_SQR1_OFFSET, regval);

  /* ADC CCR configuration */

  regval  = getreg32(STM32_ADC_CCR);
  regval &= ~(ADC_CCR_MULTI_MASK | ADC_CCR_DELAY_MASK | ADC_CCR_DDS |
              ADC_CCR_DMA_MASK | ADC_CCR_ADCPRE_MASK | ADC_CCR_VBATEN |
              ADC_CCR_TSVREFE);
  regval |=  (ADC_CCR_MULTI_NONE | ADC_CCR_DMA_DISABLED |
              ADC_CCR_ADCPRE_DIV2);
  putreg32(regval, STM32_ADC_CCR);

  /* Set ADON to wake up the ADC from Power Down state. */

  regval  = tc_adc_getreg(STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_ADON;
  tc_adc_putreg(STM32_ADC_CR2_OFFSET, regval);

  /* Restore the IRQ state */

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: tc_adc_start_sample
 *
 * Description:
 *   Perform A/D sampling.    Time must be allowed between the start of
 *   sampling and conversion (approx. 100Ms).
 *
 ****************************************************************************/

static void tc_adc_start_sample(int channel)
{
  uint32_t regval;

  /* Configure the specified channel for ADC conversion.  */

  regval = tc_adc_getreg(STM32_ADC_SQR3_OFFSET) & ADC_SQR3_RESERVED;
  regval |= channel;
  tc_adc_putreg(STM32_ADC_SQR3_OFFSET, regval);

  /* Configure the Watchdog for this channel */

  regval = tc_adc_getreg(STM32_ADC_CR1_OFFSET) & ADC_CR1_AWDCH_MASK;
  regval |= (channel << ADC_CR1_AWDCH_SHIFT);
  tc_adc_putreg(STM32_ADC_CR1_OFFSET, regval);

  /* Start the conversion */

  regval = tc_adc_getreg(STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_SWSTART;
  tc_adc_putreg(STM32_ADC_CR2_OFFSET, regval);
}

/****************************************************************************
 * Name: tc_adc_read_sample
 *
 * Description:
 *   Begin A/D conversion.  Time must be allowed between the start of
 *   sampling and conversion (approx. 100Ms).
 *
 * Assumptions:
 * 1) All output pins configured as outputs:
 * 2) Appropriate pins are driven high and low
 *
 ****************************************************************************/

static uint16_t tc_adc_read_sample(void)
{
  uint16_t retval;
  uint32_t adcsr;
  uint16_t count = 0;

  /* Validate the conversion is complete */

  adcsr = tc_adc_getreg(STM32_ADC_SR_OFFSET);
  while ((adcsr & ADC_SR_EOC) == 0)
    {
      adcsr = tc_adc_getreg(STM32_ADC_SR_OFFSET);
      count++;
    }

  /* Read the sample */

  retval = tc_adc_getreg(STM32_ADC_DR_OFFSET);
  retval &= ADC_DR_RDATA_MASK;

  if (count > 0)
    {
      iinfo("Count = %d\n", count);
    }

  return retval;
}

/****************************************************************************
 * Name: tc_y_sample
 *
 * Description:
 *   Initiate sampling on Y
 *
 ****************************************************************************/

static void tc_y_sample(void)
{
  /* Start the Y axis sampling */

  tc_adc_start_sample(LCD_XL_CHANNEL);
}

/****************************************************************************
 * Name: tc_x_sample
 *
 * Description:
 *   Initiate sampling on X
 *
 ****************************************************************************/

static void tc_x_sample(void)
{
  /* Start the X axis sampling */

  tc_adc_start_sample(LCD_YD_CHANNEL);
}

/****************************************************************************
 * Name: tc_valid_sample
 ****************************************************************************/

static inline bool tc_valid_sample(uint16_t sample)
{
  return (sample > LOWER_THRESHOLD);
}

/****************************************************************************
 * Name: tc_notify
 ****************************************************************************/

static void tc_notify(struct tc_dev_s *priv)
{
  /* If no threads have the driver open, then just dump the state */

#ifdef CONFIG_TOUCHSCREEN_REFCNT
  if ((priv->crefs == 0) && priv->sample.contact == CONTACT_UP)
    {
      priv->sample.contact = CONTACT_NONE;
      priv->sample.valid   = false;
      priv->id++;
      return;
    }
#endif

  /* If there are threads waiting on poll() for touchscreen data to become
   * available, then wake them up now.  NOTE: we wake up all waiting threads
   * because we do not know that they are going to do.  If they all try to
   * read the data, then some make end up blocking after all.
   */

  poll_notify(priv->fds, CONFIG_TOUCHSCREEN_NPOLLWAITERS, POLLIN);

  /* If there are threads waiting for read data, then signal one of them
   * that the read data is available.
   */

  if (priv->nwaiters > 0)
    {
      /* After posting this semaphore, we need to exit because the
       * touchscreen is no longer available.
       */

      nxsem_post(&priv->waitsem);
    }
}

/****************************************************************************
 * Name: tc_sample
 *
 * Assumptions:  pre-emption is disabled
 *
 ****************************************************************************/

static int tc_sample(struct tc_dev_s *priv,
                          struct tc_sample_s *sample)
{
  int ret = -EAGAIN;

  /* Is there new touchscreen sample data available? */

